app/Http/Controllers/PageController.php

select * from `musics` order by `id` desc limit 11 offset 0
select * from `albums` order by `id` desc limit 8 offset 0
select * from `artists` order by `id` desc
---
    public function index(){
        $musics = Music::orderBy('id', 'DESC')->skip(config('home.number.begin_music'))->take(config('home.number.end_music'))->get();
        $albums = Album::orderBy('id', 'DESC')->skip(config('home.number.begin_album'))->take(config('home.number.end_album'))->get();
        $artists = Artist::orderBy('id','DESC')->get();

select * from `musics` order by `id` desc limit 11 offset 0
select * from `musics`
select * from `comments` where `comments`.`music_id` = 1 and `comments`.`music_id` is not null
---
    public function music($id, $slug){
        $musics = Music::findOrFail($id);
        $songs = Music::orderBy('id', 'DESC')->skip(config('home.number.begin_music'))->take(config('home.number.end_song'))->get();
        $comments = $musics->comments()->orderBy('id', 'DESC')->get();
        $artists = $musics->artists()->get();